app/Helpers/access_helper.php

    function canCategory(string $categorySlug): bool
    {
        if (! session()->has('role_id')) {
            return false;
        }


        $roleId = (int) session('role_id');

        $categoryModel       = new PermissionCategoryModel();
        $permissionModel     = new PermissionModel();
        $rolePermissionModel = new RolePermissionModel();

        // Get category
        $category = $categoryModel
            ->where('slug', $categorySlug)
            ->where('status', 1)
            ->first();
---
SELECT *
FROM `permission_categories`
WHERE `slug` = 'agent'
AND `status` = 1
 LIMIT 1

    function user_role(string $return = 'name'): ?string
    {
        $session = session();

        if (! $session->has('role_id')) {
            return null;
        }

        $roleId = (int) $session->get('role_id');

        $roleModel = new RoleModel();
        $role = $roleModel->find($roleId);
---
SELECT *
FROM `roles`
WHERE `roles`.`id` = 2