app/Controllers/Roles.php

SELECT *
FROM `roles`
WHERE `id` != 2
---
    public function index()
    {
        check_admin();

        return view('roles/index', [
            'page_title' => 'Roles',
            'roles' => $this->roleModel
                ->where('id !=', 2)
                ->findAll(),