app/Controllers/User.php

SELECT `u`.*, `r`.`name` as `role_name`
FROM `users` `u`
LEFT JOIN `roles` `r` ON `r`.`id` = `u`.`role_id`
---
	public function index()
	{
		$db = \Config\Database::connect();
		$user = $db->table('users u')
			->select('u.*, r.name as role_name')
			->join('roles r', 'r.id = u.role_id', 'left')
			->get()
			->getResultArray();

SELECT *
FROM `roles`
---
	public function add()
	{
		$roleModel = new RoleModel();
		$data['roles'] = $roleModel->findAll();