app/Models/PermissionModel.php

SELECT *
FROM `permissions`
WHERE `category_id` = '2'
AND `status` = 1
---
    public function getByCategory($categoryId)
    {
        return $this->where('category_id', $categoryId)
            ->where('status', 1)
            ->findAll();